huangrong1995/xiaozhi-esp32-volcat/main/boards/esp-vocat/esp_vocat.cc
    void HandleEmotionLearningGesture(Gesture gesture)
    {
        switch (gesture) {
        case Gesture::SwipeLeft:  // next emotion
            ShowEmotionLearningNext();
            break;
        case Gesture::SwipeRight:  // previous emotion
            current_emotion_index_ =
                (current_emotion_index_ + kEmotionLearningCount - 1) % kEmotionLearningCount;
            ShowEmotionLearningCurrent();
            break;
        case Gesture::Tap:  // feedback for the current emotion
            ShowEmotionLearningCurrent();
            Application::GetInstance().GetAudioService().PlaySound(Lang::Sounds::OGG_SUCCESS);
            break;
        case Gesture::LongPress:
            ExitEmotionLearningMode();
            break;
        default:
            break;
        }
    }

    void HandleYogaGesture(Gesture gesture)
    {
        switch (gesture) {
        case Gesture::SwipeLeft:  // next pose
            ShowNextYogaPose();
            break;
        case Gesture::SwipeRight:  // previous pose
            ShowPrevYogaPose();
            break;
        case Gesture::Tap:  // replay the current pose
            ShowYogaPose();
            break;
        case Gesture::LongPress:
            ExitYogaChallengeMode();
            break;
        default:
            break;
        }
    }

    // Gesture timing thresholds (ms)
    static constexpr int64_t kLongPressThresholdMs = 1200;

    static void emotion_reset_timer_callback(void* arg)
    {
        auto* self = static_cast<EspVocat*>(arg);
        // Return to the presentation appropriate for the current mode instead of
        // blindly resetting to "neutral", which would wipe a mode/reminder state.
        if (self != nullptr) {
            self->ResetToStandby();
        }
    }

    void LoadHabitState()
    {
        Settings s("habit", false);
        habit_state_.last_drink_time = s.GetInt("last_drink", 0);
        habit_state_.drink_streak = s.GetInt("drink_streak", 0);
        ESP_LOGI(TAG, "Habit state loaded: last_drink=%" PRId64 ", streak=%d",
                  habit_state_.last_drink_time, habit_state_.drink_streak);
    }

    void SaveHabitState()
    {
        Settings s("habit", true);
        s.SetInt("last_drink", habit_state_.last_drink_time);
        s.SetInt("drink_streak", habit_state_.drink_streak);
        ESP_LOGI(TAG, "Habit state saved: last_drink=%" PRId64 ", streak=%d",
                  habit_state_.last_drink_time, habit_state_.drink_streak);
    }

    void MarkDrinkCompleted()
    {
        int64_t now_ms = esp_timer_get_time() / 1000;
        habit_state_.last_drink_time = now_ms;
        habit_state_.drink_streak++;
        SaveHabitState();

        ESP_LOGI(TAG, "Drink completed! Streak: %d", habit_state_.drink_streak);
        ShowTemporaryEmotion("loving", 3000);
        Application::GetInstance().GetAudioService().PlaySound(Lang::Sounds::OGG_SUCCESS);
    }

    void LockReminder()
    {
        if (reminder_mutex_ != nullptr) {
            xSemaphoreTake(reminder_mutex_, portMAX_DELAY);
        }
    }

    void UnlockReminder()
    {
        if (reminder_mutex_ != nullptr) {
            xSemaphoreGive(reminder_mutex_);
        }
    }

    // Cancel a pending deferred standby-restore. Callers must hold reminder_mutex_.
    void CancelReminderRestore()
    {
        reminder_restore_pending_ = false;
        if (reminder_restore_timer_ != nullptr) {
            esp_timer_stop(reminder_restore_timer_);
        }
    }

    // Schedule a one-shot deferred restore to the standby idle presentation.
    // Callers must hold reminder_mutex_.
    void ArmReminderRestore(uint32_t delay_ms)
    {
        reminder_restore_pending_ = true;
        if (reminder_restore_timer_ != nullptr) {
            esp_timer_stop(reminder_restore_timer_);
            esp_timer_start_once(reminder_restore_timer_,
                                 static_cast<uint64_t>(delay_ms) * 1000ULL);
        }
    }

    // Deferred standby-restore used after drink confirmation, so the display
    // returns to its presentation once the ~3s success face has been shown.
    // ResetToStandby() restores based on the current mode, so a mode change
    // made while the restore was pending is not clobbered by the idle animation.
    void RestoreFromReminderDeferred()
    {
        LockReminder();
        if (reminder_restore_pending_ && display_ != nullptr) {
            reminder_restore_pending_ = false;
            ResetToStandby();
        }
        UnlockReminder();
    }

    static void reminder_restore_callback(void* arg)
    {
        auto* self = static_cast<EspVocat*>(arg);
        if (self == nullptr) {
            return;
        }
        self->RestoreFromReminderDeferred();
    }

    // Non-blocking reminder presentation. Callers must hold reminder_mutex_.
    void ShowNextReminder()
    {
        if (!reminder_active_ || display_ == nullptr) {
            return;
        }
        // A newly shown reminder supersedes any pending deferred standby-restore.
        CancelReminderRestore();
        presentation_ = Presentation::Reminder;
        static_cast<emote::EmoteDisplay*>(display_)->ShowReminder(reminder_.emotion);
        Application::GetInstance().GetAudioService().PlaySound(reminder_.sound);
        ESP_LOGI(TAG, "Reminder active: %s (%s)",
                 reminder_.message ? reminder_.message : "drink", reminder_.emotion);
    }

    // Callers must hold reminder_mutex_.
    void DismissReminder()
    {
        if (!reminder_active_) {
            return;
        }
        reminder_active_ = false;
        ResetToStandby();
    }

    // Callers must hold reminder_mutex_.
    void PresentReminder(Reminder::Type type, const char* message, const char* emotion,
                         std::string_view sound, bool reset_snooze)
    {
        reminder_ = Reminder{type, message, emotion, sound, esp_timer_get_time() / 1000, false};
        if (reset_snooze) {
            reminder_snooze_count_ = 0;
        }
        reminder_active_ = true;
        reminder_pending_ = true;
        reminder_shown_ms_ = esp_timer_get_time() / 1000;
        ShowNextReminder();
    }

    // Detect and enqueue due reminders. Presentation and acknowledgement are
    // serialized through reminder_mutex_ so the timer task and the touch task
    // cannot race on the reminder fields.
    void EnqueueDueReminders()
    {
        LockReminder();
        int64_t now_ms = esp_timer_get_time() / 1000;

