huangrong1995/xiaozhi-esp32-volcat/main/boards/esp-vocat/esp_vocat.cc
        // Auto-snooze an unacknowledged reminder after a delay (bounded retry),
        // so an ignored reminder eventually goes quiet.
        if (reminder_active_ && (now_ms - reminder_shown_ms_) >= kReminderAutoSnoozeMs) {
            reminder_snooze_count_++;
            ESP_LOGI(TAG, "Reminder auto-snoozed (%d/%d)",
                     reminder_snooze_count_, kReminderMaxSnooze);
            if (reminder_snooze_count_ >= kReminderMaxSnooze) {
                reminder_.handled = true;
                reminder_pending_ = false;
                reminder_quiet_until_ms_ = now_ms + kDrinkReminderIntervalMs;
            }
            DismissReminder();
            UnlockReminder();
            return;
        }
        if (reminder_active_) {
            // One reminder is shown; a newly due reminder is deferred until this
            // one is handled.
            UnlockReminder();
            return;
        }

        // Re-present a snoozed (unhandled) drink reminder without resetting the
        // snooze counter. It stays pending until acknowledged or given up, so an
        // ignored reminder reaches kReminderMaxSnooze and goes quiet.
        if (reminder_pending_ && reminder_.type == Reminder::Type::Drink) {
            reminder_active_ = true;
            reminder_shown_ms_ = now_ms;
            ShowNextReminder();
            UnlockReminder();
            return;
        }

        // Fresh drink reminder: only after a resolved/quiet cycle. The counter
        // resets here, on a genuinely new interval.
        bool drink_due = (habit_state_.last_drink_time == 0 ||
                          (now_ms - habit_state_.last_drink_time) >= kDrinkReminderIntervalMs);
        if (drink_due && now_ms >= reminder_quiet_until_ms_) {
            PresentReminder(Reminder::Type::Drink, kDrinkReminderMessage, kDrinkReminderEmotion,
                            Lang::Sounds::OGG_POPUP, true);
            UnlockReminder();
            return;
        }

        // Daily schedule reminders.
        time_t now;
        struct tm timeinfo;
        time(&now);
        localtime_r(&now, &timeinfo);
        for (size_t i = 0; i < kScheduleCount; ++i) {
            const ScheduleEntry& r = kScheduleReminders_[i];
            if (timeinfo.tm_hour == r.hour && timeinfo.tm_min == r.minute) {
                PresentReminder(Reminder::Type::Schedule, r.message, r.emotion,
                                Lang::Sounds::OGG_POPUP, true);
                UnlockReminder();
                return;
            }
        }
        UnlockReminder();
    }

    static void reminder_timer_callback(void* arg)
    {
        auto* self = static_cast<EspVocat*>(arg);
        if (self == nullptr) {
            return;
        }
        // The timer only enqueues; presentation and acknowledgement are owned by
        // the reminder path (ShowNextReminder/DismissReminder via gestures), all
        // serialized through reminder_mutex_.
        self->EnqueueDueReminders();
    }

    void HandleReminderGesture(Gesture gesture)
    {
        LockReminder();
        switch (gesture) {
        case Gesture::Tap:
            if (reminder_.type == Reminder::Type::Drink) {
                // Screen tap confirms "done drinking". MarkDrinkCompleted plays the
                // success feedback and leaves the success face up for its ~3s
                // (emotion_reset_timer returns to neutral), so do NOT force an
                // idle restore on top of it.
                MarkDrinkCompleted();
                reminder_.handled = true;
                reminder_pending_ = false;
                reminder_active_ = false;
                // Return to the standby idle animation after the ~3s success face,
                // so idle pet animation resumes instead of freezing on neutral.
                ArmReminderRestore(kDrinkSuccessDurationMs);
            } else {
                // Schedule acknowledgement: feedback only, no habit change.
                Application::GetInstance().GetAudioService().PlaySound(Lang::Sounds::OGG_SUCCESS);
                reminder_.handled = true;
                reminder_pending_ = false;
                DismissReminder();
            }
            break;
        case Gesture::LongPress:
            // Ignore/snooze the reminder; bounded retry, then quiet.
            reminder_snooze_count_++;
            ESP_LOGI(TAG, "Reminder ignored (%d/%d)",
                     reminder_snooze_count_, kReminderMaxSnooze);
            if (reminder_snooze_count_ >= kReminderMaxSnooze) {
                reminder_.handled = true;
                reminder_pending_ = false;
                reminder_quiet_until_ms_ = esp_timer_get_time() / 1000 + kDrinkReminderIntervalMs;
                ESP_LOGI(TAG, "Reminder given up after %d ignores; quiet", reminder_snooze_count_);
            }
            DismissReminder();
            break;
        default:
            // Mode navigation (swipes) is blocked while a reminder is active.
            break;
        }
        UnlockReminder();
    }

    void InitializeReminderTimer()
    {
        esp_timer_create_args_t timer_args = {
            .callback = &reminder_timer_callback,
            .arg = this,
            .dispatch_method = ESP_TIMER_TASK,
            .name = "reminder",
            .skip_unhandled_events = true,
        };
        esp_timer_create(&timer_args, &reminder_timer_);
        // Check every minute (60 seconds = 60000000 us)
        esp_timer_start_periodic(reminder_timer_, 60 * 1000000);
        ESP_LOGI(TAG, "Reminder timer started");
    }

    void ShowTemporaryEmotion(const char* emotion, uint32_t duration_ms)
    {
        if (display_ == nullptr || emotion == nullptr) {
            return;
        }
        presentation_ = Presentation::TransientFeedback;
        display_->SetEmotion(emotion);
        if (emotion_reset_timer_ != nullptr) {
            esp_timer_stop(emotion_reset_timer_);
            esp_timer_start_once(emotion_reset_timer_, static_cast<uint64_t>(duration_ms) * 1000ULL);
        }
    }

    // Outer capacitive "pet" surface: feedback-only touch. A single recognized
    // touch is routed as Gesture::Pet once per debounced interaction (cooldown
    // in outer_touch_last_us_). Pet never changes mode, toggles chat, advances
    // an emotion, or records a drink. (Waking the device is handled separately.)
    void HandleOuterTouchPet()
    {
        const int64_t now = esp_timer_get_time();
        if ((now - outer_touch_last_us_) < kOuterTouchCooldownUs) {
            return;
        }
        outer_touch_last_us_ = now;
        OnGesture(Gesture::Pet);
        ShowTemporaryEmotion("happy", 2000);
    }

    static void imu_event_task(void* arg)
    {
        auto* self = static_cast<EspVocat*>(arg);
        if (self == nullptr || !self->bmi270_ready_) {
            vTaskDelete(NULL);
            return;
        }

        struct bmi2_sens_data prev = {};
        struct bmi2_sens_data cur = {};
        bool has_prev = false;
        int64_t last_shake_ms = 0;
        constexpr int kShakeDeltaThreshold = 20000;
        constexpr int64_t kShakeCooldownMs = 2000;

        while (true) {
            if (Bmi270Motion::ReadAccelRaw(cur)) {
                if (has_prev) {
                    int dx = abs(static_cast<int>(cur.acc.x) - static_cast<int>(prev.acc.x));
                    int dy = abs(static_cast<int>(cur.acc.y) - static_cast<int>(prev.acc.y));
                    int dz = abs(static_cast<int>(cur.acc.z) - static_cast<int>(prev.acc.z));
                    int shake_score = dx + dy + dz;

                    int64_t now_ms = esp_timer_get_time() / 1000;
                    if (shake_score > kShakeDeltaThreshold && (now_ms - last_shake_ms) > kShakeCooldownMs) {
                        last_shake_ms = now_ms;
                        // Shake is a mode-aware gesture: OnGesture() resets the idle
                        // timer and only Chat handles it (spec §1.3/§2.1), so a shake
                        // never silently extends a mode.
                        self->OnGesture(Gesture::Shake);
                    }
                }
                prev = cur;
                has_prev = true;
            }
            // Check yoga pose match periodically
            self->ProcessImuForYoga();
            vTaskDelay(pdMS_TO_TICKS(80));
        }
    }

    void InitializeI2c()
    {
        i2c_config_t i2c_cfg = {
            .mode = I2C_MODE_MASTER,
            .sda_io_num = AUDIO_CODEC_I2C_SDA_PIN,
            .scl_io_num = AUDIO_CODEC_I2C_SCL_PIN,
            .sda_pullup_en = true,
            .scl_pullup_en = true,
            .master = {
                .clk_speed = 400000,
            },
            .clk_flags = 0,
        };
        shared_i2c_bus_handle_ = i2c_bus_create(I2C_NUM_0, &i2c_cfg);
        if (!shared_i2c_bus_handle_) {
            ESP_LOGE(TAG, "Failed to create shared I2C bus");
            ESP_ERROR_CHECK(ESP_FAIL);
        }
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 3, 0) && !CONFIG_I2C_BUS_BACKWARD_CONFIG
        i2c_bus_ = i2c_bus_get_internal_bus_handle(shared_i2c_bus_handle_);
#else
#error "ESP-VoCat board requires i2c_bus_get_internal_bus_handle() support"
#endif
        if (!i2c_bus_) {
            ESP_LOGE(TAG, "Failed to get I2C master handle");
            ESP_ERROR_CHECK(ESP_FAIL);
        }

        temperature_sensor_config_t temp_sensor_config = TEMPERATURE_SENSOR_CONFIG_DEFAULT(10, 50);
        ESP_ERROR_CHECK(temperature_sensor_install(&temp_sensor_config, &temp_sensor));
        ESP_ERROR_CHECK(temperature_sensor_enable(temp_sensor));
    }
    uint8_t DetectPcbVersion()
        {
            gpio_config_t gpio_conf = {
                .pin_bit_mask = (1ULL << CORDEC_POWER_CTRL),
                .mode = GPIO_MODE_OUTPUT,
                .pull_up_en = GPIO_PULLUP_DISABLE,
                .pull_down_en = GPIO_PULLDOWN_DISABLE,
                .intr_type = GPIO_INTR_DISABLE
            };
            ESP_ERROR_CHECK(gpio_config(&gpio_conf));
            ESP_ERROR_CHECK(gpio_set_level(CORDEC_POWER_CTRL, 0));
            vTaskDelay(pdMS_TO_TICKS(50));

