huangrong1995/xiaozhi-esp32-volcat/main/boards/esp-vocat/esp_vocat.cc
        bool gesture = false;
        if (event == TOUCH_SLIDER_EVENT_LEFT_SWIPE || event == TOUCH_SLIDER_EVENT_RIGHT_SWIPE) {
            gesture = true;
        } else if (event == TOUCH_SLIDER_EVENT_RELEASE) {
            gesture = true;
        }

        if (!gesture) {
            return;
        }

        // The outer capacitive surface is a feedback-only "pet" input.
        self->HandleOuterTouchPet();
    }

    void EnterEmotionLearningMode()
    {
        if (mode_ == Mode::EmotionLearning) {
            return;
        }
        EnterMode(Mode::EmotionLearning);
        current_emotion_index_ = 0;
        ShowEmotionLearningCurrent();
        // Play sound to indicate entering learning mode
        auto& audio = Application::GetInstance().GetAudioService();
        audio.PlaySound(Lang::Sounds::OGG_POPUP);
        vTaskDelay(pdMS_TO_TICKS(150));
        audio.PlaySound(Lang::Sounds::OGG_SUCCESS);
        ESP_LOGI(TAG, "Entered emotion learning mode");
    }

    void ExitEmotionLearningMode()
    {
        if (mode_ != Mode::EmotionLearning) {
            return;
        }
        ExitToChat();
        ShowTemporaryEmotion("happy", 2000);
        Application::GetInstance().GetAudioService().PlaySound(Lang::Sounds::OGG_SUCCESS);
        ESP_LOGI(TAG, "Exited emotion learning mode");
    }

    void ShowEmotionLearningCurrent()
    {
        if (display_ != nullptr) {
            // Emotion-learning is a Mode presentation: it must not be clobbered
            // by transient feedback or the standby idle animation.
            presentation_ = Presentation::Mode;
            const char* emotion = kEmotionLearningEmotions_[current_emotion_index_];
            display_->SetEmotion(emotion);
            ESP_LOGI(TAG, "Emotion: %s (%s)", emotion, kEmotionLearningNames_[current_emotion_index_]);
        }
    }

    void ShowEmotionLearningNext()
    {
        current_emotion_index_ = (current_emotion_index_ + 1) % kEmotionLearningCount;
        ShowEmotionLearningCurrent();
    }

    void EnterYogaChallengeMode()
    {
        if (mode_ == Mode::Yoga) {
            return;
        }
        EnterMode(Mode::Yoga);
        current_pose_index_ = 0;
        yoga_success_until_ms_ = 0;  // start fresh: no success cooldown pending
        ShowYogaPose();
        Application::GetInstance().GetAudioService().PlaySound(Lang::Sounds::OGG_SUCCESS);
        ESP_LOGI(TAG, "Entered yoga challenge mode");
    }

    void ExitYogaChallengeMode()
    {
        if (mode_ != Mode::Yoga) {
            return;
        }
        ExitToChat();
        ShowTemporaryEmotion("happy", 2000);
        ESP_LOGI(TAG, "Exited yoga challenge mode");
    }

    void ShowYogaPose()
    {
        if (display_ != nullptr) {
            // Yoga is a Mode presentation: the arrow must not be overwritten by
            // transient feedback or the standby idle animation (spec §2.3).
            presentation_ = Presentation::Mode;
            const char* direction = kYogaPoseDirections_[current_pose_index_];
            static_cast<emote::EmoteDisplay*>(display_)->DrawArrow(direction);
            ESP_LOGI(TAG, "Yoga pose: %s (%s)", kYogaPoseNames_[current_pose_index_], direction);
        }
    }

    // Deterministic pose navigation with wraparound (spec §2.3).
    void ShowNextYogaPose()
    {
        current_pose_index_ = (current_pose_index_ + 1) % kYogaPoseCount;
        yoga_success_until_ms_ = 0;  // a manually navigated pose is immediately matchable
        ShowYogaPose();
    }

    void ShowPrevYogaPose()
    {
        current_pose_index_ =
            (current_pose_index_ + kYogaPoseCount - 1) % kYogaPoseCount;
        yoga_success_until_ms_ = 0;
        ShowYogaPose();
    }

    void CheckYogaPoseMatch(const char* motion_direction)
    {
        if (mode_ != Mode::Yoga) {
            return;
        }
        // Ignore duplicate tilt matches during the success window so the same
        // pose is not completed twice (spec §2.3 feedback order).
        int64_t now_ms = esp_timer_get_time() / 1000;
        if (now_ms < yoga_success_until_ms_) {
            return;
        }
        const char* target = kYogaPoseDirections_[current_pose_index_];
        if (strcmp(motion_direction, target) != 0) {
            return;
        }

        // Correct pose matched: block further matches, then success feedback.
        // ShowTemporaryEmotion() arms emotion_reset_timer, which calls
        // ResetToStandby() → ShowYogaPose() once the success emotion has been
        // shown for kYogaSuccessDurationMs, redrawing the (advanced) arrow.
        yoga_success_until_ms_ = now_ms + kYogaSuccessDurationMs;
        ShowTemporaryEmotion("happy", kYogaSuccessDurationMs);
        Application::GetInstance().GetAudioService().PlaySound(Lang::Sounds::OGG_SUCCESS);

        if (current_pose_index_ == kYogaPoseCount - 1) {
            // Completed all poses: completion feedback then return to Chat.
            ESP_LOGI(TAG, "Yoga challenge complete!");
            Application::GetInstance().GetAudioService().PlaySound(Lang::Sounds::OGG_SUCCESS);
            ExitYogaChallengeMode();
            return;
        }

        // Advance to the next pose; ResetToStandby() draws its arrow after the
        // success face has been shown for its duration.
        current_pose_index_++;
        ESP_LOGI(TAG, "Correct! Next pose: %s", kYogaPoseDirections_[current_pose_index_]);
    }

    void ProcessImuForYoga()
    {
        if (mode_ != Mode::Yoga || !bmi270_ready_) {
            return;
        }
        static int64_t last_check_ms = 0;
        constexpr int64_t kCooldownMs = 500;  // Only check every 500ms
        int64_t now_ms = esp_timer_get_time() / 1000;
        if (now_ms - last_check_ms < kCooldownMs) {
            return;
        }
        last_check_ms = now_ms;

        // Read accelerometer data
        struct bmi2_sens_data data = {};
        if (Bmi270Motion::ReadAccelRaw(data)) {
            // Determine tilt direction
            int acc_x = data.acc.x;
            int acc_y = data.acc.y;
            const char* direction = nullptr;
            // Check dominant tilt
            if (abs(acc_x) > abs(acc_y)) {
                if (acc_x > 5000) {
                    direction = "right";
                } else if (acc_x < -5000) {
                    direction = "left";
                }
            } else {
                if (acc_y > 5000) {
                    direction = "down";
                } else if (acc_y < -5000) {
                    direction = "up";
                }
            }
            if (direction != nullptr) {
                // A tilt is a meaningful Yoga interaction: keep the mode alive.
                // (This is the IMU-mode-aware path, distinct from the Chat-only
                // shake path, per spec §2.3.)
                ResetModeIdleTimer();
                CheckYogaPoseMatch(direction);
            }
        }
    }

