huangrong1995/xiaozhi-esp32-volcat/main/boards/esp-vocat/esp_vocat.cc
        };
        ESP_ERROR_CHECK(gpio_config(&power_gpio_config));

        gpio_set_level(POWER_CTRL, 0);
    }

#ifdef CONFIG_ESP_VIDEO_ENABLE_USB_UVC_VIDEO_DEVICE
    void InitializeCamera() {
        esp_video_init_usb_uvc_config_t usb_uvc_config = {
            .uvc = {
                .uvc_dev_num = 1,
                .task_stack = 4096,
                .task_priority = 5,
                .task_affinity = -1,
            },
            .usb = {
                .init_usb_host_lib = true,
                .task_stack = 4096,
                .task_priority = 5,
                .task_affinity = -1,
            },
        };

        esp_video_init_config_t video_config = {
            .usb_uvc = &usb_uvc_config,
        };

        camera_ = new EspVideo(video_config);
    }
#endif // CONFIG_ESP_VIDEO_ENABLE_USB_UVC_VIDEO_DEVICE

public:
    ~EspVocat() {
        // Stop tasks
        if (charge_task_handle_ != nullptr) {
            vTaskDelete(charge_task_handle_);
        }
        if (touch_task_handle_ != nullptr) {
            vTaskDelete(touch_task_handle_);
        }
        if (imu_task_handle_ != nullptr) {
            vTaskDelete(imu_task_handle_);
        }
        if (touch_slider_task_handle_ != nullptr) {
            vTaskDelete(touch_slider_task_handle_);
            touch_slider_task_handle_ = nullptr;
        }
        if (touch_slider_handle_ != nullptr) {
            touch_slider_sensor_delete(touch_slider_handle_);
            touch_slider_handle_ = nullptr;
        }
        if (touch_button_handle_ != nullptr) {
            touch_button_sensor_delete(touch_button_handle_);
            touch_button_handle_ = nullptr;
        }

        // Delete objects
        delete charge_;
        delete cst816s_;
        delete display_;
        // Note: backlight_ (PwmBacklight) and camera_ (EspVideo) are not deleted here
        // because their base classes (Backlight, Camera) don't have virtual destructors.
        // Since EspVocat is a singleton that lives for the device lifetime, this is acceptable.

        // Remove GPIO ISR handler
        gpio_isr_handler_remove(TP_PIN_NUM_INT);
        if (emotion_reset_timer_ != nullptr) {
            esp_timer_stop(emotion_reset_timer_);
            esp_timer_delete(emotion_reset_timer_);
            emotion_reset_timer_ = nullptr;
        }
        if (mode_idle_timer_ != nullptr) {
            esp_timer_stop(mode_idle_timer_);
            esp_timer_delete(mode_idle_timer_);
            mode_idle_timer_ = nullptr;
        }
        if (reminder_timer_ != nullptr) {
            esp_timer_stop(reminder_timer_);
            esp_timer_delete(reminder_timer_);
            reminder_timer_ = nullptr;
        }
        if (reminder_mutex_ != nullptr) {
            vSemaphoreDelete(reminder_mutex_);
            reminder_mutex_ = nullptr;
        }
        if (reminder_restore_timer_ != nullptr) {
            esp_timer_stop(reminder_restore_timer_);
            esp_timer_delete(reminder_restore_timer_);
            reminder_restore_timer_ = nullptr;
        }

        // Disable temperature sensor
        if (temp_sensor != NULL) {
            temperature_sensor_disable(temp_sensor);
            temperature_sensor_uninstall(temp_sensor);
            temp_sensor = NULL;
        }
    }

    EspVocat() : boot_button_(BOOT_BUTTON_GPIO)
    {
        const esp_timer_create_args_t emotion_timer_args = {
            .callback = &EspVocat::emotion_reset_timer_callback,
            .arg = this,
            .dispatch_method = ESP_TIMER_TASK,
            .name = "emotion_rst",
            .skip_unhandled_events = true,
        };
        ESP_ERROR_CHECK(esp_timer_create(&emotion_timer_args, &emotion_reset_timer_));

        const esp_timer_create_args_t mode_idle_timer_args = {
            .callback = &EspVocat::mode_idle_timer_callback,
            .arg = this,
            .dispatch_method = ESP_TIMER_TASK,
            .name = "mode_idle",
            .skip_unhandled_events = true,
        };
        ESP_ERROR_CHECK(esp_timer_create(&mode_idle_timer_args, &mode_idle_timer_));

        const esp_timer_create_args_t reminder_restore_timer_args = {
            .callback = &EspVocat::reminder_restore_callback,
            .arg = this,
            .dispatch_method = ESP_TIMER_TASK,
            .name = "rmd_rst",
            .skip_unhandled_events = true,
        };
        ESP_ERROR_CHECK(esp_timer_create(&reminder_restore_timer_args, &reminder_restore_timer_));

        if (reminder_mutex_ == nullptr) {
            reminder_mutex_ = xSemaphoreCreateMutex();
        }

        InitializeI2c();
        uint8_t pcb_version = DetectPcbVersion();
        InitializeCharge();
        InitializeCst816sTouchPad();
        InitializeBmi270();

        InitializeSpi();
        InitializeSt77916Display(pcb_version);
        InitializeButtons();
        InitializeCapacitiveTouchPads();
        LoadHabitState();
        InitializeReminderTimer();
#ifdef CONFIG_ESP_VIDEO_ENABLE_USB_UVC_VIDEO_DEVICE
        InitializeCamera();
#endif // CONFIG_ESP_VIDEO_ENABLE_USB_UVC_VIDEO_DEVICE
    }

    virtual AudioCodec* GetAudioCodec() override
    {
        static BoxAudioCodec audio_codec(
            i2c_bus_,
            AUDIO_INPUT_SAMPLE_RATE,
            AUDIO_OUTPUT_SAMPLE_RATE,
            AUDIO_I2S_GPIO_MCLK,
            AUDIO_I2S_GPIO_BCLK,
            AUDIO_I2S_GPIO_WS,
            AUDIO_I2S_GPIO_DOUT,
            AUDIO_I2S_GPIO_DIN,
            AUDIO_CODEC_PA_PIN,
            AUDIO_CODEC_ES8311_ADDR,
            AUDIO_CODEC_ES7210_ADDR,
            AUDIO_INPUT_REFERENCE);
        return &audio_codec;
    }

    virtual Display* GetDisplay() override
    {
        return display_;
    }

    Cst816s* GetTouchpad()
    {
        return cst816s_;
    }

    virtual Backlight* GetBacklight() override
    {
        return backlight_;
    }

    virtual Camera* GetCamera() override {
        return camera_;
    }
};

// Static array definitions for emotion learning
const char* EspVocat::kEmotionLearningEmotions_[] = {
    "happy", "sad", "angry", "shocked",
    "confused", "sleepy", "loving", "neutral"
};
const char* EspVocat::kEmotionLearningNames_[] = {
    "开心", "伤心", "生气", "惊讶",
    "困惑", "困了", "喜欢", "平静"
};

// Daily schedule reminders: 8:00 wake, 12:00 lunch, 14:00 nap, 18:00 dinner, 21:00 sleep.
const EspVocat::ScheduleEntry EspVocat::kScheduleReminders_[] = {
    {8, 0, "该起床了~", "happy"},
    {12, 0, "该吃午饭了~", "happy"},
    {14, 0, "该睡午觉了~", "sleepy"},
    {18, 0, "该吃晚饭了~", "happy"},
    {21, 0, "该睡觉了~", "sleepy"},
};

// Static array definitions for yoga challenge
const char* EspVocat::kYogaPoseNames_[] = {
    "向上倾斜", "向下倾斜", "向左倾斜", "向右倾斜", "向上倾斜", "向下倾斜"
};
const char* EspVocat::kYogaPoseDirections_[] = {
    "up", "down", "left", "right", "up", "down"
};

DECLARE_BOARD(EspVocat);
